Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: With this function you can delete a value (or values) from an array at any given position.
zh_cn: 使用此函数，你可以从一个数组的任意给定位置删除一个(或多个)值。

source: With this function you can delete a whole section of an ini file, which will also remove all key-value pairs that are associated with it.
zh_cn: 通过此函数，您可以删除 ini 文件的整个部分，这也将删除与其关联的所有键值对。

source: With this function you can delete any time line from your game.
zh_cn: 通过此函数，你可以从你的游戏中删除任何时间线。

source: With this function you can destroy (remove from the room) a sequence element.
zh_cn: 通过此函数，您可以破坏(从房间中移除)一个序列元素。

source: With this function you can destroy a given particles system and remove it from memory.
zh_cn: 通过此函数，您可以销毁给定的粒子系统，并将其从内存中删除。

source: With this function you can destroy a sequence object that has been created dynamically.
zh_cn: 使用此函数，您可以销毁动态创建的序列对象。

source: With this function you can destroy any camera.
zh_cn: 通过此函数，你可以销毁任何相机。

source: With this function you can determine whether SDF rendering is enabled or disabled for the specified font
zh_cn: 使用此功能，您可以确定是启用还是禁用指定字体的SDF渲染

source: With this function you can draw a 1 pixel wide line between any two points in the game room.
zh_cn: 通过此函数，您可以在游戏房间中的任意两点之间画一条1像素宽的线。

source: With this function you can draw a 1 pixel wide line with the colour blended between colour 1 at the first point and colour 2 at the second point.
zh_cn: 通过此函数，您可以使用第一个点的颜色1和第二个点的颜色2之间的混合颜色绘制一条1像素宽的线。

source: With this function you can draw a coloured bar to show a constant value.
zh_cn: 通过此函数，您可以绘制一个彩色条来显示常量值。

source: With this function you can draw a line of a specific width with the colour blended between colour 1 at the first point and colour 2 at the second point.
zh_cn: 通过此函数，您可以使用第一点的颜色1和第二点的颜色2之间的混合颜色绘制一条特定宽度的线。

source: With this function you can draw a line of a specified width between any two points in the game room.
zh_cn: 通过此函数，您可以在游戏房间中的任意两点之间绘制一条指定宽度的线。

source: With this function you can draw a single pixel anywhere on the screen with a colour that you define.
zh_cn: 使用此函数，您可以在屏幕上的任何地方用您定义的颜色绘制单个像素。

source: With this function you can draw a single pixel anywhere on the screen, using the currently set draw colour and alpha.
zh_cn: 通过此函数，你可以在屏幕上的任何地方画一个像素，使用当前设置的绘制颜色和alpha。

source: With this function you can draw a sprite distorted over the area defined by the four corner coordinates.
zh_cn: 通过此函数，您可以在四个角坐标定义的区域上绘制扭曲的精灵。

source: With this function you can draw a surface at a given position within the room, with the top left corner of the image being drawn at the specified x/y position.
zh_cn: 通过此函数，您可以在房间内的给定位置绘制一个表面，图像的左上角绘制在指定的x/y位置。

source: With this function you can draw any given tile from a tile set - compete with rotations, flips and mirrors - setting the frame (if animated) and the position within the room.
zh_cn: 通过此函数，您可以从图块集中绘制任何给定的图块 -支持旋转、翻转和镜像 -设置帧(如果有动画)和在房间内的位置。

source: With this function you can draw any string at any position within the room (for drawing real numbers you should use the string() function to convert them into text).
zh_cn: 使用此函数，您可以在房间的任何位置绘制任何字符串(对于绘制实数，您应该使用string()函数将其转换为文本)。

source: With this function you can draw either an outline of a circle or a filled circle, and if it is filled you can define the interior and exterior fill colours.
zh_cn: 通过此函数，你可以画一个圆的轮廓或一个填充的圆，如果它被填充，你可以定义内部和外部填充颜色。

source: With this function you can draw either an outline of a circle or a filled circle.
zh_cn: 使用此函数，您可以绘制圆的轮廓或填充圆。

source: With this function you can draw either an outline of a rectangle or a filled rectangle by defining an area where the (x1,y1) position is the top left corner and the (x2,y2) position is the bottom right corner.
zh_cn: 通过此函数，您可以通过定义(x1,y1)位置为左上角，(x2,y2)位置为右下角的区域来绘制矩形或填充矩形的轮廓。

source: With this function you can draw either an outline of a rectangle or a filled rectangle where the (x1,y1) position is the top left corner and the (x2,y2) position is the bottom right corner.
zh_cn: 使用此函数，您可以绘制矩形或填充矩形的轮廓，其中(x1,y1)位置是左上角，(x2,y2)位置是右下角。

source: With this function you can draw either an outline of a rounded rectangle or a filled rounded rectangle where the (x1,y1) position is the top left corner and the (x2,y2) position is the bottom right corner.
zh_cn: 使用此函数，您可以绘制圆角矩形或填充圆角矩形的轮廓，其中(x1,y1)位置是左上角，(x2,y2)位置是右下角。

source: With this function you can draw either an outline of a triangle or a filled triangle.
zh_cn: 使用此函数，您可以绘制三角形的轮廓或填充三角形。

source: With this function you can draw either an outline of an ellipse or a filled ellipse by defining a rectangular area that will then have the ellipse created to fit.
zh_cn: 使用此函数，您可以通过定义一个矩形区域来绘制椭圆的轮廓或填充椭圆，然后创建一个适合的椭圆。

source: With this function you can draw part of any sprite at a given position within the room.
zh_cn: 通过此函数，你可以在房间内的给定位置绘制任何精灵的一部分。

source: With this function you can draw part of any surface at a given position within the room.
zh_cn: 通过此函数，您可以在房间内的给定位置绘制任何表面的一部分。

source: With this function you can dynamically add a script function to Timelines at any given "moment" within that time line, where a "moment" is the equivalent of one game tick (or step).
zh_cn: 通过此函数，你可以在时间线内任何给定的"时刻"动态地添加一个脚本函数，其中"时刻"相当于一个游戏节拍(或一步)。

source: With this function you can easily select a number of characters from within a string to be copied to another one.
zh_cn: 通过此函数，您可以轻松地从一个字符串中选择一些字符复制到另一个字符串中。

source: With this function you can enable (true) or disable (false) the view of any room within your game except the current one.
zh_cn: 通过此函数，您可以启用(true)或禁用(false)游戏中除当前房间之外的任何房间的视图。

source: With this function you can enable or disable SDF rendering for the specified font.
zh_cn: 使用此功能，您可以启用或禁用指定字体的SDF渲染。

source: With this function you can enable or disable anti-aliasing (AA) for SWF format vector sprites.
zh_cn: 通过此函数，您可以启用或禁用 SWF 格式矢量精灵的抗锯齿 (AA)。

source: With this function you can enable or disable the application surface.
zh_cn: 通过此函数，您可以启用或禁用应用程序表面。

source: With this function you can enable or disable the garbage collector.
zh_cn: 通过此函数，您可以启用或禁用垃圾收集器。

source: With this function you can end the game (and the Game End Event will be triggered).
zh_cn: 通过此函数，你可以结束游戏(游戏结束事件将被触发)。

source: With this function you can execute a method on all or a range of elements in the array.
zh_cn: 使用此函数，您可以对数组中的所有元素或一定范围的元素执行一个方法。

source: With this function you can fade a group of sounds in or out over a given length of time, or it can be used to set the group gain instantly.
zh_cn: 通过此函数，您可以在给定的时间长度内使一组声音渐隐或渐隐，也可以用来立即设置组增益。

source: With this function you can fade a sound in or out over a given length of time, or it can be used to set the sound gain instantly.
zh_cn: 通过此函数，您可以在给定的时间长度内淡入或淡出声音，也可以使用它来即时设置声音增益。

source: With this function you can find how many key/values pairs the (previously created) DS map contains.
zh_cn: 通过此函数，你可以找到(之前创建的)DS map包含多少键/值对。

source: With this function you can find out how many active instances of the specified object exists in the room.
zh_cn: 通过此函数，您可以找出房间中存在多少个指定对象的活动实例。

source: With this function you can find out the number of individual vertices defined in any given vertex buffer.
zh_cn: 使用此函数，你可以找出在任何给定的顶点缓冲区中定义的单个顶点的数量。

source: With this function you can find out what the current cap value is on particles permitted in the physics simulation (you can set this value using physics_particle_set_max_count()).
zh_cn: 通过此函数，您可以找到物理模拟中允许的粒子的当前上限值(可以使用physics_particle_set_max_count()设置此值)。

source: With this function you can find out what the current density is for particles in the physics simulation (you can set this value using physics_particle_set_density()).
zh_cn: 通过此函数，您可以找到物理模拟中粒子的当前密度(您可以使用physics_particle_set_density()设置这个值)。

source: With this function you can find out what the current gravity scale factor is for particles in the physics simulation (you can set this value using physics_particle_set_gravity_scale()).
zh_cn: 通过此函数，您可以找到物理模拟中粒子的当前重力缩放倍数(可以使用physics_particle_set_gravity_scale()设置这个值)。

source: With this function you can find out what the current linear damping is for particles in the physics simulation (you can set this value using physics_particle_set_damping()).
zh_cn: 通过此函数，您可以找到物理模拟中粒子的当前线性阻尼(您可以使用physics_particle_set_damping()设置这个值)。

source: With this function you can find out what the current radius (in pixels) is for particles in the physics simulation (you can set this value using physics_particle_set_radius()).
zh_cn: 使用此函数，您可以找出物理模拟中粒子的当前半径(以像素为单位)(您可以使用physics_particle_set_radius()设置这个值)。

source: With this function you can find out whether the target platform supports game pads (returns true) or not (returns false).
zh_cn: 通过此函数，你可以发现目标平台是否支持游戏手柄(返回true)或不支持(返回false)。

source: With this function you can find the height of the base sprite asset, with no transforms, in pixels.
zh_cn: 使用此函数，您可以找到基本sprite资源的高度，没有任何变换，以像素为单位。

source: With this function you can find the index of the first element that returns true to the given predicate.
zh_cn: 使用此函数，您可以找到返回给定条件下的第一个元素的索引。

source: With this function you can find the overlapping region of the rectangle defined by (x1,y1) to (x2,y2) on each of the attached displays.
zh_cn: 通过此函数，您可以在每个连接的显示器上找到由(x1，y1)到(x2，y2)定义的矩形的重叠区域。

source: With this function you can find the total number number of variables defined for a struct.
zh_cn: 通过此函数，您可以找到为结构定义的变量的总数。

source: With this function you can find the total number number of variables defined for an instance.
zh_cn: 通过此函数，您可以找到为一个实例定义的变量的总数。

source: With this function you can find the value stored in the priority queue with the highest priority, and if more than one value has the same priority then any one of them could be returned in any order.
zh_cn: 使用此函数，您可以找到存储在优先级队列中的具有最高优先级的值，如果有多个值具有相同的优先级，那么它们中的任何一个都可以以任何顺序返回。

source: With this function you can find the value stored in the priority queue with the lowest priority, and if more than one value has the same priority then any one of them could be returned in any order.
zh_cn: 使用此函数，您可以找到存储在优先级队列中的具有最低优先级的值，如果有多个值具有相同的优先级，那么它们中的任何一个都可以以任何顺序返回。

source: With this function you can find the value that equates to the position between two other values for a given percentage.
zh_cn: 使用此函数，您可以找到与给定百分比的其他两个值之间的位置相等的值。

source: With this function you can find the width of the base resource sprite, with no transforms, in pixels.
zh_cn: 通过此函数，你可以找到基本资源精灵的宽度，不需要转换，以像素为单位。

source: With this function you can find which slots are at a specified room-space position in the Spine sprite associated with the current instance.
zh_cn: 使用此函数，您可以在与当前实例相关联的Spine sprite中找到位于指定房间空间位置的插槽。

source: With this function you can flag a specific object as being solid or not (for more information on the "solid" flag see the section on the Object Editor).
zh_cn: 通过此函数，你可以将一个特定的对象标记为实体或非实体(有关"实体"标记的更多信息，请参阅对象编辑器部分)。

source: With this function you can flag a specific object as being visible or not (for more information on the "visible" flag see the section on the Object Editor).
zh_cn: 使用此函数，您可以将特定的对象标记为可见或不可见(有关"可见"标记的更多信息，请参阅对象编辑器部分)。

source: With this function you can flush the entire draw pipeline.
zh_cn: 使用此函数，您可以刷新整个绘制管道。

source: With this function you can force a particle system to draw all the current particles on the screen.
zh_cn: 使用此函数，你可以强制一个粒子系统在屏幕上绘制所有当前的粒子。

source: With this function you can force a string to contain only lower case characters.
zh_cn: 使用此函数，您可以强制字符串只包含小写字符。

source: With this function you can force a string to contain only upper case characters.
zh_cn: 使用此函数，您可以强制字符串只包含大写字符。

source: With this function you can free up the pointer index value associated with the sound ID.
zh_cn: 使用此函数，您可以释放与声音ID关联的指针索引值。

source: With this function you can get GameMaker to check the currently opened file to see if the line being read has finished.
zh_cn: 通过此函数，你可以让GameMaker检查当前打开的文件，看看正在读取的行是否已经完成。

source: With this function you can get GameMaker to draw a path to the screen.
zh_cn: 通过此函数，您可以让GameMaker绘制一条路径到屏幕。

source: With this function you can get all the assets of a given type that have the given tags assigned to them.
zh_cn: 使用此函数，您可以获得给定类型的所有资源，这些资源被分配了给定的标签。

source: With this function you can get an attachment slot alpha value.
zh_cn: 通过此函数，你可以得到一个附件插槽的alpha值。

source: With this function you can get an attachment slot colour.
zh_cn: 通过此函数，您可以获得附件槽颜色。

source: With this function you can get that position based on the actual GUI size, making GUI buttons and HUD elements easier to create and interact with.
zh_cn: 通过此函数，你可以根据实际的GUI大小来确定位置，使得GUI按钮和HUD元素更容易创建和交互。

source: With this function you can get the ID of the current surface being targeted for drawing to.
zh_cn: 通过此函数，您可以获得要绘制到的当前表面的ID。

source: With this function you can get the a byte alignment for the given buffer ID.
zh_cn: 使用此函数，您可以获得给定缓冲区ID的字节对齐。

source: With this function you can get the a pointer to the raw, aligned buffer address.
zh_cn: 通过此函数，你可以得到一个指向原始的、对齐的缓冲区地址的指针。

source: With this function you can get the absolute value for the global volume of all sounds and music for a specific listener.
zh_cn: 通过此函数，您可以获得特定侦听器(specific listener)的所有声音和音乐的全局音量的绝对值。

source: With this function you can get the actual system name of the selected font asset.
zh_cn: 通过此函数，您可以获得所选字体资源的实际系统名称。

source: With this function you can get the colour value of any pixel that is being drawn to the current render target.
zh_cn: 使用此函数，你可以得到任何被绘制到当前渲染目标的像素的颜色值。

source: With this function you can get the current animation set being used by your skeletal animation sprite.
zh_cn: 通过此函数，你就可以得到你的骨骼动画精灵所使用的当前动画集。

source: With this function you can get the current cursor being used in the game window, with the return value being any one of the constants listed below (to set the current cursor being used you can use the function window_set_cursor() which also takes these constants):
zh_cn: 使用此函数，您可以获得游戏窗口中正在使用的当前光标，返回值为下列常量之一(要设置正在使用的当前光标，您可以使用window_set_cursor()函数，此函数也采用这些常量):

source: With this function you can get the current height (in pixels) of the game window.
zh_cn: 通过此函数，你可以得到游戏窗口的当前高度(以像素为单位)。

source: With this function you can get the current maximum level of anisotropy when using the tf_anisotropic filter mode (see gpu_get_tex_mip_filter() for more information) on a shader sampler.
zh_cn: 使用此函数，您可以在着色器采样器上使用tf_anisotropic filter模式(有关详细信息，请参见gpu_get_tex_mip_filter())时获得当前最大的各向异性级别。

source: With this function you can get the current maximum level of anisotropy when using the tf_anisotropic filter mode (see gpu_get_tex_mip_filter() for more information).
zh_cn: 使用此函数，您可以在使用tf_anisotropic filter模式时获得当前最大的各向异性级别(有关详细信息，请参见gpu_get_tex_mip_filter())。

source: With this function you can get the current mip filter mode for a given shader sampler.
zh_cn: 使用此函数，你可以为一个给定的着色器采样器获得当前的mip过滤器模式。

source: With this function you can get the current mip filter mode.
zh_cn: 通过此函数，您可以获得当前的mip过滤模式。

source: With this function you can get the current value of a gamepad "hat".
zh_cn: 通过此函数，你可以得到一个游戏手柄"帽子"的当前值。

source: With this function you can get the current value of an analogue button, from 0 to 1, where 0 is no pressure and 1 is full pressure.
zh_cn: 通过此函数，你可以得到一个模拟按钮的当前值，从0到1，其中0是无压力，1是满压力。

source: With this function you can get the current width (in pixels) of the game window.
zh_cn: 通过此函数，你可以得到游戏窗口的当前宽度(以像素为单位)。

source: With this function you can get the currently set maximum mipmap level which is to be used for a given shader sampler.
zh_cn: 通过此函数，你可以得到当前设置的最大纹理贴图级别，这个级别将用于给定的着色器采样器。

source: With this function you can get the currently set maximum mipmap level which is to be used, where a value of 0 is the highest resolution, 1 is to use the first mipmap, 2 is the second etc...
zh_cn: 通过此函数，您可以获得当前设置的要使用的最大mipmap级别，其中值0表示最高分辨率，1表示使用第一个mipmap，2表示第二个MIP map，依此类推...

source: With this function you can get the full abgr 32bit value of any pixel of a (previously created) surface.
zh_cn: 使用此函数，您可以获得(之前创建的)表面的任何像素的完整abgr 32位值。

source: With this function you can get the full abgr 32bit value of any pixel that is being drawn to the current render target.
zh_cn: 使用此函数，你可以得到当前渲染目标中任何像素的完整abgr 32位值。

source: With this function you can get the height (in pixels) of the GUI as used in the Draw GUI Event.
zh_cn: 使用此函数，您可以获得在Draw GUI事件中使用的GUI的高度(以像素为单位)。

source: With this function you can get the internal Windows id value (the HWND, a pointer).
zh_cn: 通过此函数，您可以获得Windows内部的id值(指针HWND)。

source: With this function you can get the length (number of entries) of an array dimension.
zh_cn: 通过此函数，您可以获得数组维度的长度(条目的数量)。

source: With this function you can get the minimum mipmap level which is currently used for a given shader sampler.
zh_cn: 使用此函数，您可以获得当前用于给定着色器采样器的最小mipmap级别。

source: With this function you can get the minimum mipmap level which is currently used, where a value of 0 is the highest resolution, 1 is to use the first mipmap, 2 is the second etc...
zh_cn: 通过此函数，您可以获得当前使用的最小中见大贴图级别，其中值0表示最高分辨率，1表示使用第一个中见大贴图，2表示第二个，依此类推...

source: With this function you can get the name (as a string) of the attachment for the given slot of the currently assigned sprite.
zh_cn: 使用此函数，你可以获得当前指定精灵的给定槽的附件的名称(作为一个字符串)。

source: With this function you can get the number of days between two dates.
zh_cn: 通过此函数，你可以得到两个日期之间的天数。

source: With this function you can get the number of days that the given month has, either 28, 29, 30 or 31.
zh_cn: 使用此函数，你可以得到给定月份的天数，可以是28，29，30或者31。

source: With this function you can get the number of days that the given year has, returning 365 for a normal year, and 366 for a leap year.
zh_cn: 通过此函数，您可以得到给定年份的天数，对于正常年份返回365天，对于闰年返回366天。

source: With this function you can get the number of hours between two dates.
zh_cn: 使用此函数，你可以得到两个日期之间的小时数。

source: With this function you can get the number of minutes between two dates.
zh_cn: 通过此函数，你可以得到两个日期之间的分钟数。

source: With this function you can get the number of months between two dates.
zh_cn: 通过此函数，你可以得到两个日期之间的月份数。

source: With this function you can get the number of seconds between two dates.
zh_cn: 通过此函数，你可以得到两个日期之间的秒数。

source: With this function you can get the number of weeks between two dates.
zh_cn: 使用此函数，你可以得到两个日期之间的周数。

source: With this function you can get the number of years between two dates.
zh_cn: 使用此函数，你可以得到两个日期之间的年数。

source: With this function you can get the size of any font resource, which is the point value shown by the font resource dialogue.
zh_cn: 通过此函数，您可以获得任何字体资源的大小，这是由字体资源对话框显示的点值。

source: With this function you can get the size of the given buffer in bytes.
zh_cn: 使用此函数，您可以获得给定缓冲区的字节大小。

source: With this function you can get the size of the given vertex buffer in bytes.
zh_cn: 使用此函数，你可以得到给定顶点缓冲区的大小，以字节为单位。

source: With this function you can get the speed of the point (as defined in the Path Editor or when you dynamically add a path point using path_add_point()) expressed as a percentage.
zh_cn: 使用此函数，你可以获得点的速度(在路径编辑器中定义，或者当你使用path_add_point()动态添加一个路径点时)，用百分比表示。

source: With this function you can get the total number of active moments for a timeline (an "active" moment is one which has code or DnD„¢ added to it).
zh_cn: 通过此函数，您可以获得时间线的活动时刻总数("活动"时刻是指添加了代码或DnD的时刻)。

source: With this function you can get the type of asset being referenced from its name (a string).
zh_cn: 通过此函数，您可以从资源的名称(字符串)中获得被引用的资源的类型。

source: With this function you can get the unique ID value of any instance from the currently active instance list.
zh_cn: 使用此函数，您可以从当前活动的实例列表中获取任何实例的唯一ID值。

source: With this function you can get the unique index ID of the camera assigned to a specific view in a room other than the current one.
zh_cn: 通过此函数，你可以获得相机的唯一索引ID分配到一个特定的视图，而不是当前的一个房间。

source: With this function you can get the value from a given named global variable.
zh_cn: 使用此函数，您可以从给定的命名全局变量中获取值。

source: With this function you can get the value from a given named variable within a struct.
zh_cn: 使用此函数，您可以从结构中的给定命名变量获取值。

source: With this function you can get the value from a given named variable.
zh_cn: 使用此函数，您可以从给定的命名变量中获取值。

source: With this function you can get the value from a specified key.
zh_cn: 通过此函数，你可以从一个指定的键中获取值。

source: With this function you can get the x coordinate (within the given grid disc-shaped region) of the value being searched for.
zh_cn: 使用此函数，您可以获得要搜索的值的x坐标(在给定的网格圆盘形区域内)。

source: With this function you can get the x coordinate (within the given rectangular grid region) of the value being searched for.
zh_cn: 使用此函数，您可以获得要搜索的值的x坐标(在给定的矩形网格区域内)。

source: With this function you can get the x coordinate of a position on any given path.
zh_cn: 通过此函数，您可以得到任意给定路径上位置的x坐标。

source: With this function you can get the x position (in pixels) within the browser if it is an HTML5 game or within the display if it is a Windows, Ubuntu (Linux) or macOS game.
zh_cn: 如果是HTML5游戏，你可以在浏览器中获得x的位置(以像素为单位);如果是Windows、Ubuntu (Linux)或macOS游戏，你可以在屏幕中获得x的位置。

source: With this function you can get the x position of the mouse cursor (in pixels) within the browser if it is an HTML5 game or within the display if it is a Windows, Ubuntu (Linux) or macOS game.
zh_cn: 如果是HTML5游戏，你可以在浏览器中获得鼠标光标的x位置(以像素为单位);如果是Windows、Ubuntu (Linux)或macOS游戏，你可以在屏幕中获得鼠标光标的x位置。

source: With this function you can get the y coordinate (within the given grid disc-shaped region) of the value being searched for.
zh_cn: 使用此函数，您可以获得要搜索的值的y坐标(在给定的网格圆盘形区域内)。

source: With this function you can get the y coordinate (within the given rectangular grid region) of the value being searched for.
zh_cn: 使用此函数，您可以获得要搜索的值的y坐标(在给定的矩形网格区域内)。

source: With this function you can get the y coordinate of a position on any given path.
zh_cn: 使用此函数，你可以得到任意给定路径上一个位置的y坐标。

source: With this function you can get the y position (in pixels) within the browser if it is an HTML5 game or within the display if it is a Windows, Ubuntu (Linux) or macOS game.
zh_cn: 如果是HTML5游戏，你可以在浏览器中获得y的位置(以像素为单位);如果是Windows、Ubuntu (Linux)或macOS游戏，你可以在屏幕中获得y的位置。

source: With this function you can get the y position of the mouse cursor (in pixels) within the browser if it is an HTML5 game or within the display if it is a Windows, Ubuntu (Linux) or macOS game.
zh_cn: 通过此函数，如果是HTML5游戏，你可以在浏览器中获得鼠标光标的y位置(以像素为单位);如果是Windows、Ubuntu (Linux)或macOS游戏，你可以在屏幕中获得鼠标光标的y位置。

source: With this function you can get whether mipmapping is switched off, switched on for everything or switched on only for texture groups selected in the Texture Group Manager on a shader sampler.
zh_cn: 使用此函数，您可以了解是关闭mipmapping贴图，打开所有贴图，还是只打开在着色器采样器的纹理组管理器中选择的纹理组。

source: With this function you can get whether mipmapping is switched off, switched on for everything or switched on only for texture groups selected in the Texture Group Manager.
zh_cn: 通过此函数，您可以了解是关闭mipmapping贴图，打开所有贴图，还是只打开在纹理组管理器中选择的纹理组。

source: With this function you can increment a given datetime value by a specific number of days, and it will return the new datetime value.
zh_cn: 使用此函数，您可以给定的日期时间值增加特定的天数，它将返回新的日期时间值。

source: With this function you can increment a given datetime value by a specific number of hours, and it will return the new datetime value.
zh_cn: 使用此函数，您可以给定的日期时间值增加特定的小时数，它将返回新的日期时间值。

source: With this function you can increment a given datetime value by a specific number of minutes, and it will return the new datetime value.
zh_cn: 使用此函数，您可以给定的日期时间值增加特定的分钟数，它将返回新的日期时间值。

source: With this function you can increment a given datetime value by a specific number of months, and it will return the new datetime value.
zh_cn: 使用此函数，您可以给定的日期时间值增加特定的月数，它将返回新的日期时间值。

source: With this function you can increment a given datetime value by a specific number of seconds, and it will return the new datetime value.
zh_cn: 使用此函数，您可以将给定的datetime值增加特定的秒数，它将返回新的datetime值。

source: With this function you can increment a given datetime value by a specific number of weeks, and it will return the new datetime value.
zh_cn: 使用此函数，您可以将给定的datetime值增加特定的周数，它将返回新的datetime值。

source: With this function you can increment a given datetime value by a specific number of years, and it will return the new datetime value.
zh_cn: 使用此函数，您可以将给定的datetime值增加特定的年数，它将返回新的datetime值。
